{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"activation": "relu", "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "data_format": "channels_last", "filters": 16, "dilation_rate": [1, 1], "strides": [1, 1], "trainable": true, "name": "conv2d_1", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": 1, "distribution": "normal"}}, "padding": "valid", "batch_input_shape": [null, 32, 32, 3], "bias_constraint": null, "dtype": "float32", "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "name": "max_pooling2d_1", "pool_size": [4, 4], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activation": "relu", "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "data_format": "channels_last", "filters": 32, "dilation_rate": [1, 1], "strides": [1, 1], "trainable": true, "name": "conv2d_2", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": 1, "distribution": "normal"}}, "padding": "valid", "bias_constraint": null, "kernel_size": [5, 5]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_1", "units": 30, "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null}}, {"class_name": "Dense", "config": {"activation": "softmax", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_2", "units": 10, "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null}}], "keras_version": "2.2.2", "backend": "tensorflow"}