{"config": [{"class_name": "Conv2D", "config": {"trainable": true, "kernel_constraint": null, "filters": 16, "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "name": "conv2d_1", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": 1, "scale": 2.0}}, "bias_regularizer": null, "dilation_rate": [1, 1], "batch_input_shape": [null, 32, 32, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "padding": "valid", "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_1", "data_format": "channels_last", "pool_size": [4, 4], "padding": "valid", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_constraint": null, "filters": 32, "kernel_size": [5, 5], "activity_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "name": "conv2d_2", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": 1, "scale": 2.0}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "padding": "valid", "strides": [1, 1]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "activation": "relu", "use_bias": true, "units": 30, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_2", "activation": "softmax", "use_bias": true, "units": 10, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2"}