{"config": {"layers": [{"config": {"batch_input_shape": [null, 32, 32, 3], "sparse": false, "name": "input_5", "dtype": "float32"}, "name": "input_5", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "name": "conv0", "activity_regularizer": null, "data_format": "channels_last", "filters": 32, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "kernel_size": [7, 7]}, "name": "conv0", "class_name": "Conv2D", "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"config": {"center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_constraint": null, "axis": 3, "beta_regularizer": null, "name": "bn0", "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "momentum": 0.99, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001}, "name": "bn0", "class_name": "BatchNormalization", "inbound_nodes": [[["conv0", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu", "name": "activation_8"}, "name": "activation_8", "class_name": "Activation", "inbound_nodes": [[["bn0", 0, 0, {}]]]}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "name": "conv1", "activity_regularizer": null, "data_format": "channels_last", "filters": 64, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "kernel_size": [5, 5]}, "name": "conv1", "class_name": "Conv2D", "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pool"}, "name": "max_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"config": {"center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_constraint": null, "axis": 3, "beta_regularizer": null, "name": "bn1", "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "momentum": 0.99, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001}, "name": "bn1", "class_name": "BatchNormalization", "inbound_nodes": [[["max_pool", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu", "name": "activation_9"}, "name": "activation_9", "class_name": "Activation", "inbound_nodes": [[["bn1", 0, 0, {}]]]}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "name": "conv2d_2", "activity_regularizer": null, "data_format": "channels_last", "filters": 16, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "kernel_size": [1, 1]}, "name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"config": {"center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_constraint": null, "axis": 3, "beta_regularizer": null, "name": "bn2", "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "momentum": 0.99, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001}, "name": "bn2", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_2"}, "name": "flatten_2", "class_name": "Flatten", "inbound_nodes": [[["bn2", 0, 0, {}]]]}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_regularizer": null, "units": 10, "trainable": true, "name": "fc", "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activation": "softmax"}, "name": "fc", "class_name": "Dense", "inbound_nodes": [[["flatten_2", 0, 0, {}]]]}], "name": "super_cool_model", "input_layers": [["input_5", 0, 0]], "output_layers": [["fc", 0, 0]]}, "keras_version": "2.2.2", "class_name": "Model", "backend": "tensorflow"}